---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireType.TemperatureRating
source: html/96eda530-ab34-3812-8d94-49e141330011.htm
---
# Autodesk.Revit.DB.Electrical.WireType.TemperatureRating Property

The temperature rating type of the wire type.

## Syntax (C#)
```csharp
public TemperatureRatingType TemperatureRating { get; set; }
```

## Remarks
Should retrieved from relevant WireMaterial object.